class ExclusionCriteria:

    def __init__(self):
        pass

    def filter(self, row) -> bool:
        raise NotImplemented



class
### functions

"""

דברים בסטטוס canceled שהם לא באמת canceled:

-	אנשים שעשו ביטול למנוי ויצרו מנוי אחר (כאילו, עברו לתכנית אחרת) אם יש פער גדול מידי בין הזמנים, אז זה לא נחשב (נניח עד חודשיים הפרש, אחרת זה פרישה ואז חזרה).
-	יש כמה כפילויות במשתמשים - להסיר אותם. (הם נמצאים תמיד ב- canceled)
-	אם גם השם והשם משפחה / מייל זהה, אז להסיר
-	לפעמים כפילויות זה יכול להיות 17 פעם.
-	יש כאלה שרצו לשנות מנוי, ויצאו ונכנסו מחדש לאתר
-	איך לדעת מי מהכפילויות אמיתי? זה תמיד הזה שהוא אקטיב.
-	יכול להיות כפילויות שכולן canceled, ואז תכלס זה אותו אחד 
-	המצב היחיד שמישהו הוא churn יותר מפעם אחת, זה אם הוא עשה מנוי, ביטל. אחרי חודשיים עשה מנוי שוב, ואז שוב פרש.
-	אם מישהו cancelled ולא שילמו כלום, אז לא נחשב גם כן

"""